package com.study.study;

public class Oop {
    public static void main(String[] args) {
        //객체(인스턴스) - 변수와 함수를 가지고 있다 (new)
        // 데이터 + 기능 = 객체(컴퓨터)
        //변수 - 값을 저장할수 있는 공간 int(자료형) a(변수) =8-> 변수와 선언
        //메서드=함수 -  ex) void channelUp () {  } 리턴타입이 없으면 void
        // 리턴타입이 있으면 메서드 명 앞에 자료형을 붙여서 리턴을 받는다
        // 매개변수(자료형+변수명)

        // null 주는 이유 //
// return 사용법
// 클래스에 각각 뭐가 적혀야 하는지 감을 못잡겠당 1. 필드  2.생성자(new)


// 연결된 코드로 가는 단축키있나?? 호출한다?? //연결의 개념(호출) 주소참조 이어지는 길을 못찾겠다 membermain
//.을붙이면 연결된다는 뜻?// 주소호출 전달?? 부른다는뜻?/ / . 참조
//딱 봤을때 이게 클래스인지 메소드인지 생성자인지 알수 있는 기본 형이 있나???->> 대충 ㅇㅋㅇㅋ,
//
//자료형? 클래스 자료형  -클래스 자료형(Product, Student) 같은건 정해진 모양이없다 그래서 그모양에 맞는 값을 넣어줘야해
//                             int a =10; 은 int 도 동그라미 10도 동그라미라서 리터럴로 정해져있어서 정수형이 대입가능하다
//                             하지만 클래스 자료형은 정해진 리터럴이 없기때문에 만들어줘야한다 그게 생성자)
//                             EX) Product product = new product()
//                                 새로운 자료형           생성자해서 새로운자료형에 모양에 맞게 만든다라고 생각하자
// 클래스는 그래서 틀이라는 내용@@
//
    }
}
